In [1]:
import pandas as pd

In [13]:
data = [{'name': 'John', 'age': 30, 'city':'Taipei'},
        {'name': 'Mary', 'age': 25, 'city':'Taichung'},
        {'name': 'Ken', 'age': 35, 'city':'Kaohsiung'}]
df = pd.DataFrame(data)
df

   name  age       city
0  John   30     Taipei
1  Mary   25   Taichung
2   Ken   35  Kaohsiung

In [7]:
df.loc[0, 'age'] = 33
df

   name  age       city
0  John   33     Taipei
1  Mary   25   Taichung
2   Ken   35  Kaohsiung

In [14]:
df.loc[[False, False, True]]

  name  age       city
2  Ken   35  Kaohsiung

In [ ]:
# 照條件改，把叫 Ken 的人居住地改到 Hualien
condition = df['name'] == 'Ken'
# df.loc[df['name']=='Ken'] = 'Hualien'
df.loc[condition, 'city'] = 'Hualien'

df

   name  age      city
0  John   33    Taipei
1  Mary   25  Taichung
2   Ken   35   Hualien